Catalogs/МобильныеПриложенияРаспознаванияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>МобильныеПриложенияРаспознаванияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеНастройкиРаспознаваниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧастотаЗагрузкиДокументовИзСервиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьЭлементыНастройкиИнтерфейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьЗамечанияПередСозданиемДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадаватьВопросОСохраненииСоответствийДляРаспознанныхСтрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСохраненияСоответствий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСохраненияСоответствийБРД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьНовыеЭлементыСправочниковПослеСоздания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОбработчикаПоказыватьИзображенияВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтправкиВложенийИзПочтыНаРаспознавание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспознаватьВложенияИзПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочтаДляОбработкиВложений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОбработкиВложений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспознаватьФайлыИзКаталога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтправкиФайловИзКаталогаНаРаспознавание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогДляОбработкиФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключаяВложенныеКаталоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СкладБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогНоменклатурыДляГрупповогоСоздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПомечатьДокументОбработаннымПриПрикреаленииИзображения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСчетФактуруПриСозданииОснования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МобильныеПриложенияРаспознаванияДокументов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключеноКСервисуРаспознавания = РаспознаваниеДокументов.ПодключеноКСервисуРаспознавания();
	АккаунтАктивирован = РаспознаваниеДокументов.АккаунтАктивирован();
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	
	АдресЭлПочты = ТекущиеНастройки.АдресЭлПочты;
	
	ОбновитьПодключенныеМобильныеПриложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПерерисоватьПоСостоянию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодключенныеМобильныеПриложения

&НаКлиенте
Процедура ПодключенныеМобильныеПриложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Элемент.ТекущиеДанные.Ссылка);
	
	Обработчик = Новый ОписаниеОповещения("ПослеДобавленияИзмененияМобильногоПриложения", ЭтотОбъект);
	
	ОткрытьФорму(
		"Справочник.МобильныеПриложенияРаспознаванияДокументов.Форма.ФормаЭлемента",
		ПараметрыОткрытия,
		ЭтотОбъект,
		Элемент.ТекущиеДанные.Идентификатор,
		,
		,
		Обработчик
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключенныеМобильныеПриложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ПослеДобавленияИзмененияМобильногоПриложения", ЭтотОбъект);
	
	ОткрытьФорму(
		"Справочник.МобильныеПриложенияРаспознаванияДокументов.Форма.ФормаЭлемента",
		,
		ЭтотОбъект,
		Новый УникальныйИдентификатор,
		,
		,
		Обработчик
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключенныеМобильныеПриложенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизация(Команда)
	
	ВыполнитьАвторизацию();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьАдресЭлПочты(Команда)
	
	СохранитьАдресЭлПочтыНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Адрес электронной почты изменен.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПодключенныеМобильныеПриложения();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ОткрытьФорму("Справочник.МобильныеПриложенияРаспознаванияДокументов.Форма.ФормаЗагрузки");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КомандыДействий

&НаКлиенте
Процедура ВыполнитьАвторизацию()
	
	Обработчик = Новый ОписаниеОповещения("ПослеПроверкиПодключенияКСервисуРаспознавания", ЭтотОбъект);
	РаспознаваниеДокументовКлиент.ПоказатьАвторизациюИТС(Обработчик, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерисоватьПоСостоянию()
	
	Если ПодключеноКСервисуРаспознавания Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.МобильныеПриложения;
	КонецЕсли;
	
	Если ПодключеноКСервисуРаспознавания И Не АккаунтАктивирован Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ОжиданиеАктивации;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодключенныеМобильныеПриложения()
	
	ПодключенныеМобильныеПриложения.Очистить();
	
	Справочники.МобильныеПриложенияРаспознаванияДокументов.АктуализироватьДанные();
	
	Для Каждого МобильноеПриложение Из Справочники.МобильныеПриложенияРаспознаванияДокументов.ПолучитьСписок() Цикл
		ЗаполнитьЗначенияСвойств(ПодключенныеМобильныеПриложения.Добавить(), МобильноеПриложение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеОбработчикиСобытий

&НаКлиенте
Процедура ПослеПроверкиПодключенияКСервисуРаспознавания(Результат, Контекст) Экспорт
	
	Если Результат Тогда 
		ПодключеноКСервисуРаспознавания = РаспознаваниеДокументовСлужебныйВызовСервера.ПодключеноКСервисуРаспознавания();
		ПерерисоватьПоСостоянию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияИзмененияМобильногоПриложения(Результат, Контекст) Экспорт
	
	ОбновитьПодключенныеМобильныеПриложения();
	ПерерисоватьПоСостоянию();
	
КонецПроцедуры

#КонецОбласти

#Область БизнесЛогика

&НаСервере
Процедура СохранитьАдресЭлПочтыНаСервере()
	
	РаспознаваниеДокументовКоннекторСлужебный.УстановитьАдресЭлектроннойПочты(АдресЭлПочты);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.АдресЭлПочты = АдресЭлПочты;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
